In [1]:
import pandas as pd
import numpy as np

In [2]:
s1 = pd.Series([1, 2, 3, 4])

In [3]:
# Rのデータフレームを基にした表形式データ
df = pd.DataFrame([
[1, "a", True],
[2, "b", True],
[3, "c", False]
])
df

   0  1      2
0  1  a   True
1  2  b   True
2  3  c  False

In [45]:
df = pd.DataFrame(np.arange(100).reshape(25, 4))
df.tail(3)

     0   1   2   3
22  88  89  90  91
23  92  93  94  95
24  96  97  98  99

In [49]:
df.describe()

               0          1          2          3
count  25.000000  25.000000  25.000000  25.000000
mean   48.000000  49.000000  50.000000  51.000000
std    29.439203  29.439203  29.439203  29.439203
min     0.000000   1.000000   2.000000   3.000000
25%    24.000000  25.000000  26.000000  27.000000
50%    48.000000  49.000000  50.000000  51.000000
75%    72.000000  73.000000  74.000000  75.000000
max    96.000000  97.000000  98.000000  99.000000

In [6]:
df.columns = ["01", "02", "03", "04"]

In [7]:
df["01"].head() # 1列をSeriesで取り出す

0     0
1     4
2     8
3    12
4    16
Name: 01, dtype: int32

In [8]:
df[["01", "03"]].head() # ２列をDFで取り出す

   01  03
0   0   2
1   4   6
2   8  10
3  12  14
4  16  18

In [9]:
df[:3] # 3行目までを取り出す

   01  02  03  04
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11

In [10]:
df.loc[:3, :]

   01  02  03  04
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [11]:
df.loc[:, ["01", "03"]].head()

   01  03
0   0   2
1   4   6
2   8  10
3  12  14
4  16  18

In [12]:
# pd.read_csv -> df.to_csv
# pd.read_excel -> df.to_excel
# table = pd.read_html()
# df.to_pickle # シリアライズ

In [13]:
smoke_df = pd.read_csv("res/smoke.csv")

In [14]:
(smoke_df["喫煙数"] > 30).head()

0     True
1    False
2    False
3    False
4    False
Name: 喫煙数, dtype: bool

In [15]:
smoke_df[smoke_df["喫煙数"] > 30] # bool配列による選択

    州名    喫煙数    肺がん
0   AK  30.34  25.88
5   CT  31.10  22.83
6   DC  40.46  27.27
7   DE  33.60  24.55
26  NE  42.40  23.03

In [16]:
smoke_df.query("喫煙数 > 20 and 肺がん < 15") # 式による検索

    州名    喫煙数    肺がん
9   ID  20.10  13.58
20  MN  22.06  14.20
28  NM  21.16  14.59
32  PE  23.78  12.11
35  SD  20.94  14.11

In [17]:
smoke_df.dtypes

州名      object
喫煙数    float64
肺がん    float64
dtype: object

In [18]:
smoke_df.loc[:, 'name'] = smoke_df.loc[:, '州名'].astype(str) # string変換し列追加

In [19]:
smoke_df.columns

Index(['州名', '喫煙数', '肺がん', 'name'], dtype='object')

In [20]:
smoke_df.sort_values('肺がん').head()

    州名    喫煙数    肺がん name
38  UT  14.00  12.01   UT
32  PE  23.78  12.11   PE
25  ND  19.96  12.12   ND
9   ID  20.10  13.58   ID
35  SD  20.94  14.11   SD

In [21]:
def categorize(v):
    if v > 30:
        return 2
    elif v > 20:
        return 1
    else:
        return 0

smoke_df.loc[:, 'category'] = smoke_df.loc[:, '肺がん'].apply(categorize)
smoke_df.head()

   州名    喫煙数    肺がん name  category
0  AK  30.34  25.88   AK         1
1  AL  18.20  17.05   AL         0
2  AR  18.24  15.98   AR         0
3  AZ  25.82  19.80   AZ         0
4  CA  28.60  22.07   CA         1

In [22]:
import pickle
smoke_df.to_pickle("./smoke.pickle") # Serialize

In [23]:
dates = pd.date_range(start = "2020-01-01", end = "2020-12-31")

In [24]:
dates_df = pd.DataFrame(np.random.randint(10, 50, 366), index = dates, columns = ["val"])
dates_df.describe

<bound method NDFrame.describe of             val
2020-01-01   32
2020-01-02   20
2020-01-03   30
2020-01-04   41
2020-01-05   32
...         ...
2020-12-27   48
2020-12-28   22
2020-12-29   31
2020-12-30   43
2020-12-31   41

[366 rows x 1 columns]>

In [25]:
dates_df.groupby(pd.Grouper(freq = "M")).mean()

                  val
2020-01-31  31.451613
2020-02-29  29.034483
2020-03-31  27.903226
2020-04-30  30.933333
2020-05-31  29.387097
2020-06-30  26.733333
2020-07-31  25.741935
2020-08-31  28.258065
2020-09-30  27.833333
2020-10-31  28.387097
2020-11-30  28.200000
2020-12-31  33.645161

In [26]:
# dropna, fillna,

In [29]:
dates_df["val"].var() # std, describe, corr,

129.31654315442765

In [53]:
import numpy as np
import pandas as pd
np.random.seed(123)
dates = pd.date_range(start="2020-01-01", periods=31)
df = pd.DataFrame(np.random.randint(1, 10, 31), index=dates, columns=["rand"])
df_year = pd.DataFrame(df.groupby(pd.Grouper(freq='W-MON')).sum(), columns=["rand"]) # 最初は、始点(1/1)～最初の月曜日(1/6)迄
print(df_year)

            rand
2020-01-06    26
2020-01-13    16
2020-01-20    24
2020-01-27    39
2020-02-03    18